In [4]:
import os

In [5]:
os.getcwd()

'C:\\Users\\nisar'

In [6]:
import pandas as pd

In [7]:
data2=pd.read_csv(r"Mydat3.tsv",sep='\t')

In [8]:
data2

   Rollno   name  batch
0    1001  pinky   1840
1    1002   john   1765
2    1003   neha   1345
3    1004    raj   1540

In [9]:
data2=pd.read_csv(r"Mydat3.tsv")

In [10]:
data2

  Rollno\tname\tbatch
0   1001\tpinky\t1840
1    1002\tjohn\t1765
2    1003\tneha\t1345
3     1004\traj\t1540

# If we not used sep agrument it will be llok like above